app/forms/auth_token_form.rb

SELECT  1 AS one FROM "auth_tokens" WHERE "auth_tokens"."token" = $1 LIMIT $2  [["token", "jVM5YbX1k8Q"], ["LIMIT", 1]]
---
  def unique_token
    errors.add(:token, :taken) if AuthToken.where(token: token).any?