app/forms/user_form.rb

SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "dhruvil11@mailinator.com"], ["LIMIT", 1]]
---
  def unique_email_address
    errors.add(:email, :taken) if User.where(email: email).any?

SELECT  1 AS one FROM "users" WHERE "users"."phone_number" = $1 LIMIT $2  [["phone_number", "1234567890"], ["LIMIT", 1]]
---
  def unique_phone_number
    errors.add(:phone_number, :taken) if User.where(phone_number: phone_number).any?

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def initialize(option = {}, id = nil)
    @object = id.nil? ? User.new : User.find(id)