app/controllers/application_controller.rb

SELECT  "auth_tokens".* FROM "auth_tokens" WHERE "auth_tokens"."token" = $1 LIMIT $2  [["token", "JuCmDluc3UU"], ["LIMIT", 1]]
---
  def authenticate_token
    @auth_token = AuthToken.find_by(token: request.headers['Authorization'])

DELETE FROM "auth_tokens" WHERE "auth_tokens"."id" = $1  [["id", 17]]
---
  def delete_expired_token
    return unless @auth_token.expired?

    @auth_token.delete