app/controllers/restaurants_controller.rb

SELECT "restaurants".* FROM "restaurants"
---
  def index
    restaurants = Restaurant.all
    render json: { restaurants: restaurants.map { |restaurant| RestaurantPresenter.new(restaurant)._show } }, status: :ok

SELECT  "restaurants".* FROM "restaurants" WHERE "restaurants"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def exists
    @restaurant = Restaurant.find_by(id: params[:id])