app/controllers/sessions_controller.rb

  def logout
    @auth_token.destroy
---
DELETE FROM "auth_tokens" WHERE "auth_tokens"."id" = $1  [["id", 32]]

  def exists
    @user = User.find_by(email: user_params[:email])
    render json: { error: 'User not found' }, status: :not_found unless @user.present?
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "a"], ["LIMIT", 1]]