app/controllers/users_controller.rb

  def role_index
    users = RoledUsersQuery.new(params[:role], User.all).all
    render json: { users: users.map { |user| UserPresenter.new(user)._show } }, status: :ok
---
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", "manager"]]

  def reset_password
    @user.update!(user_params)
---
UPDATE "users" SET "reset_password_token_expire_at" = $1, "password_digest" = $2, "reset_password_token" = $3, "updated_at" = $4 WHERE "users"."id" = $5

  def exists
    @user = params[:id].nil? ? User.find_by(reset_password_token: params[:reset_password_token]) : User.find(params[:id])
    render json: { error: 'User not found' }, status: :not_found unless @user.present?
---
SELECT  "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "K5FqG0V4Bqw"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."reset_password_token" = $1 LIMIT $2  [["reset_password_token", "6erFpAVLm6k"], ["LIMIT", 1]]